
#include"caipiao.h"

//----------------------------------------------
void jisuancishu(int a[][49],int b[][7])
{
    for(int i=M;i<N;i++)            //统计最近第M期到第N期
	{
		for(int j=0;j<6;j++)
		{
			for(int k=0;k<33;k++)
			{
				if(a[0][k]==b[i][j]) {a[1][k]++;break;}	
			}
			

		}
		for(int j=33;j<49;j++)
			if(a[0][j]==b[i][6]) a[1][j]++;
	}
//-----------------------------
	cout<<"--------------最近第"<<M<<"期--第"<<N<<"期数字出现情况如下-----------\n";
	cout<<"\n---------------------红球出现的次数------------------------";
	double t=6.0*(N-M)/33;
    int w;
	for(int i=0;i<33;i++)      
	{
		if(i%5==0) cout<<endl;
		cout.width(2);
		cout<<a[0][i]<<":";
		if(N-M>200)  w=int(a[1][i]-t);
		else w=a[1][i];
		cout.width(3);
		cout<<w<<".    ";
	}
    cout<<"平均次数t=="<<t<<"\n-----------------------------------------------------------\n";
	cout<<"---------------------蓝球出现的次数：----------------------";
//--------------------------------------
    int i=33;
	for(int j=0;j<16;i++,j++)
	{
        if(j%5==0) cout<<endl;
		cout.width(2);
		cout<<a[0][i]<<":";
		cout.width(3);
		cout<<a[1][i]<<".      ";
	}
	double m=(N-M)/16.0;
	cout<<"                          平均次数m=="<<m;
	cout<<"\n-----------------------------------------------------------\n";

//------------------------------------------------------------
    cout<<"                  出现次数最少的红蓝球                   \n";
	int c[7]={0};
	for(i=0;i<6;i++)
	{
		c[i]=a[0][0];
		int p=a[1][0],q=p,a1=0,b1=a1;
		for(int j=0;j<33;j++)
		{
			if(a[1][j]<p){p=a[1][j];a1=j;}
			if(a[1][j]>q){q=a[1][j];b1=j;}
		}
		c[i]=a[0][a1];
		a[1][a1]=a[1][b1];
		cout.width(5);
		cout<<c[i];
	}

    int p1=a[1][33],a2=0;
	for(i=33;i<49;i++)
		if(a[1][i]<p1) {p1=a[1][i];a2=i;}
	c[6]=a[0][a2];
	cout<<":   "<<c[6]<<endl;
    cout<<"\n-----------------------------------------------------------\n";
	

}
